const catalog =
[
    {
        id: 0,
        name: "Синий диван",
        description: "Красивый синий диван, сделанный из слез PHP программистов.",
        price: 22990,
    },
    {
        id: 1,
        name: "Темный диван",
        description: "Этот диван был вдохновлен великим символом аутизма - Абдиком.",
        price: 99000,
    },
    {
        id: 2,
        name: "Коричневый диван",
        description: "Забудьте о том, что помнили - этот диван цвета JavaScript поможет вам в этом.",
        price: 12900,
    },
    {
        id: 3,
        name: "Зеленый диван",
        description: "Зеленый цвет символизирует безопасность - поэтому диван оборудован системой ПВО.",
        price: 23500,
    },
    {
        id: 4,
        name: "Желтое кресло",
        description: "Невероятно яркое кресло для отдыха, жесткая ткань SUPERPAIN обеспечивает первоклассную боль в спине.",
        price: 10900,
    },
    {
        id: 5,
        name: "Диван TypeScript",
        description: "Чуть более яркий диван, чем JavaScript, сделанный благодаря статической типизации.",
        price: 13000,
    },
    {
        id: 6,
        name: "Кресло Tralalero",
        description: "Кресло, дизайн которого сделан с помощью ИИ, отлично держится на трех ножках.",
        price: 10700,
    },
    {
        id: 7,
        name: "Кресло Декабрь",
        description: "Белоснежное элитарное кресло, созданное божественными силами для джедаев.",
        price: 900000,
    },
    {
        id: 8,
        name: "Минималист кресло",
        description: "Это кресло названо так, потому что состоит из материалов минимально возможного качества.",
        price: 9900,
    },
    {
        id: 9,
        name: "Кресло De Bille",
        description: "Строгий и элегантный дизайн этого кресла подчеркивает характер его владельца.",
        price: 999999,
    },
    {
        id: 10,
        name: "Кресло Cool",
        description: "Металлическая основа и сплав темного аллюминия обеспечивают отличное рассеивание тепла горящей жопы.",
        price: 17700,
    },
    {
        id: 12,
        name: "Оранжевый диван",
        description: "Цвет апельсина был подобран вовсе не случайно - он ассоциируется с бутылкой холодного DaDa.",
        price: 900000,
    },
    {
        id: 13,
        name: "Стулья Crop",
        description: "Название подчеркивает обрезаную природу этих стульев. Поэтому мы продаем рамку на стене.",
        price: 500,
    },
    {
        id: 14,
        name: "Кресло ГООООООООЛ",
        description: "Брутальное кресло из обожженой медвежьей шкуры для настоящих ценителей ГООООООООООООЛ.",
        price: 60007,
    },
    {
        id: 15,
        name: "Кресло Royale",
        description: "Не будьте обмануты богатым дизайном - это кресло может быть поставлено только в кустах.",
        price: 34800,
    },
    {
        id: 16,
        name: "Кресло Frame",
        description: "Отличное кресло для наружнего размещения. Помогает спастись от душных PHP-кодеров.",
        price: 4900,
    },
    {
        id: 17,
        name: "Кресло Пикми",
        description: "Купите это кресло. Пожалуйста. Оно розовое. Оно не такое как все. Оно другое. Купите его.",
        price: 33333,
    },
    {
        id: 18,
        name: "Стул Morningwood",
        description: "Стул ручной работы, созданный для концентрации. Нет ничего лучше утреннего сидения на этом стуле.",
        price: 6470,
    },
    {
        id: 19,
        name: "Тумба Юмба",
        description: "Деревянная тумба с округлыми краями, ручная работа африканских мастеров мирового уровня.",
        price: 6900,
    },
    {
        id: 20,
        name: "Набор Classique",
        description: "Минималистичный, строгий, яркий, удобный - этот набор из двух стульев и столика вам точно не нужен.",
        price: 40400,
    }
]
